Cylinder_Flow_CFDEM/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          3600;
        startFace       1064400;
    }
    outlet
    {
        type            patch;
        nFaces          3600;
        startFace       1068000;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          24000;
        startFace       1071600;
    }
)

// ************************************************************************* //
